import React from 'react';

const PrivacyPage = () => {
  return (
    <div>
      <div className='d-flex h-100 text-white text-aling-justify text-uk-hyphens bg-dark px-mb-1'>
        <div className='cover-container d-flex w-100 h-100 mx-auto flex-column'>

          <h1 className='text-center mb-4'>
            Конфіденційність
          </h1>

          <p>
             <b>FICE File Sharer</b> розуміє важливість захисту персональних даних 
             наших користувачів. Ми прагнемо забезпечити безпечне використання 
             платформи, дотримуючись усіх законодавчих норм.
          </p>
          
          <h3 className='mt-3'>
            Збір та використання даних
          </h3>

          <ul>
            <li>
                Ми збираємо дані для створення облікових записів і забезпечення 
                роботи платформи. Це включає інформацію, яку надають користувачі 
                під час реєстрації через Google або GitHub.
            </li>

            <li>
                Використовуємо ці дані лише для надання послуг, підтримки та 
                оптимізації функціоналу платформи.
            </li>
          </ul>

          <h3 className='mt-3'>
            Передача даних третім сторонам
          </h3>

          <p>
            Ми не передаємо ваші дані третім особам без вашої згоди, окрім 
            випадків, передбачених законодавством.
          </p>

          <h3 className='mt-3'>
            Cookies
          </h3>

          <p>
            <b>FICE File Sharer</b> використовує файли cookie для зберігання ваших 
            налаштувань і покращення зручності використання платформи. Ви можете 
            змінити налаштування файлів cookie у вашому браузері.
          </p>

          <h3 className='mt-3'>
            Ваші права
          </h3>

          <p>
            Ви можете запросити доступ до своїх даних, редагувати їх або видалити 
            свій обліковий запис. З усіх питань звертайтесь до нашої служби 
            підтримки.
          </p>
        </div>
      </div>
    </div>
  );
};

export default PrivacyPage;