import React from 'react'

const SecurityPage = () => {
  return (
    <div>
      <div className='d-flex h-100 text-white text-aling-justify text-uk-hyphens bg-dark px-mb-1'>
        <div className='cover-container d-flex w-100 h-100 mx-auto flex-column'>
          <h1 className='text-center mb-4'>Безпека</h1>

          <p>
            <b>FICE File Sharer</b> надає першочергове значення захисту ваших
            даних і безпеці платформи. Ми впровадили низку заходів для
            збереження вашої конфіденційності та захисту від загроз.
          </p>

          <h3 className='mt-3'>Заходи безпеки</h3>

          <ul>
            <li>
              <b>Контроль доступу</b> – доступ до ваших файлів контролюється
              старостами груп, що надають дозволи на читання та запис.
            </li>

            <li>
              <b>Регулярні оновлення</b> – платформа регулярно оновлюється для
              усунення вразливостей та покращення захисту даних.
            </li>
          </ul>

          <h3 className='mt-3'>Повідомлення про інциденти</h3>

          <p>
            У разі виявлення витоку даних ми негайно повідомимо про це
            користувачів і вживемо заходів для запобігання подальшим загрозам.
          </p>

          <h3 className='mt-3'>Поради для користувачів</h3>

          <p>
            Ми рекомендуємо використовувати надійні паролі та регулярно
            змінювати їх у своїх акаунтах Google та GitHub для додаткового рівня
            захисту.
          </p>
        </div>
      </div>
    </div>
  )
}

export default SecurityPage
